music_app/app/models/user.rb

    def reset_session_token!

        self.update!(session_token: self.class.generate_session_token) #update! the session_token and save in the DB
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "cfacfAZEYmDXaw1HWn-iTA"], ["id", 20]]