music_app/app/controllers/application_controller.rb

    def current_user

        return nil unless session[:session_token] #does session cookie have session_token attribute
        User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "cfacfAZEYmDXaw1HWn-iTA"], ["LIMIT", 1]]