music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "jujuju"], ["password_digest", "$2a$12$oNUQ/zqvEsEdW4WEo/coI.B9AlfnJzkkpgBYKTZcxUei.CyNiy7VW"], ["session_token", "QjINt8UoKd7SCZpnY0hqeQ"]]
---
    def create

        @user = User.new(user_params)
        if @user.save #save runs validations on the user params (email, password) based on user model validations